Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АС_НормализоватьНаименованиеУслуги</Name>
					<Comment>Преобразовывать наименование услуги автоматически: первая буква заглавная, остальные строчные.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРабот</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем АС_ВидимостьДоУслуги;

&НаКлиенте
Перем АС_ПоказыватьВсеПоля;

&НаКлиенте
&После("ПриОткрытии")
Процедура АС_ПриОткрытииПосле(Отказ)

	АС_ПоказыватьВсеПоля = Ложь;
	АС_УстановитьТипНоменклатурыПоУмолчанию();
	АС_УстановитьПараметрыУслугиПоУмолчанию();
	АС_ОграничитьСписокТиповНоменклатуры();
	АС_РазрешитьИзменениеТипаНоменклатуры();
	АС_ОбновитьВидимостьУслуги();

КонецПроцедуры

&НаКлиенте
&После("ТипНоменклатурыПриИзменении")
Процедура АС_ТипНоменклатурыПриИзмененииПосле(Элемент)

	АС_ОграничитьСписокТиповНоменклатуры();
	АС_УстановитьПараметрыУслугиПоУмолчанию();
	АС_ОбновитьВидимостьУслуги();

КонецПроцедуры

&НаКлиенте
&После("ПослеЗаписи")
Процедура АС_ПослеЗаписиПосле(ПараметрыЗаписи)

	АС_РазрешитьИзменениеТипаНоменклатуры();

КонецПроцедуры

&НаКлиенте
Процедура АС_УстановитьТипНоменклатурыПоУмолчанию()

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;

	Если Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас")
		Или Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		Возврат;
	КонецЕсли;

	Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас");

КонецПроцедуры

&НаКлиенте
Процедура АС_УстановитьПараметрыУслугиПоУмолчанию()

	Если Объект.ТипНоменклатуры <> ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		Возврат;
	КонецЕсли;

	Объект.КатегорияНоменклатуры = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.ПустаяСсылка");

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;

	Объект.АС_НормализоватьНаименованиеУслуги = Истина;
	Объект.ЗапретитьВводДробногоКоличества = Истина;

КонецПроцедуры

&НаКлиенте
Процедура АС_РазрешитьИзменениеТипаНоменклатуры()

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;

	РеквизитыДляРазблокирования = Новый Массив;
	РеквизитыДляРазблокирования.Добавить("ТипНоменклатуры");
	ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(
		ЭтотОбъект,
		РеквизитыДляРазблокирования);

КонецПроцедуры

&НаКлиенте
Процедура АС_ОграничитьСписокТиповНоменклатуры()

	СписокТиповНоменклатуры = Элементы.ТипНоменклатуры.СписокВыбора;
	СписокТиповНоменклатуры.Очистить();
	СписокТиповНоменклатуры.Добавить(
		ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Запас"),
		"Запас");
	СписокТиповНоменклатуры.Добавить(
		ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"),
		"Услуга");

КонецПроцедуры

&НаКлиенте
Процедура АС_НаименованиеПриИзменении(Элемент)

	АС_ПрименитьНормализациюНаименованияУслуги();

КонецПроцедуры

&НаКлиенте
Процедура АС_НормализоватьНаименованиеУслугиПриИзменении(Элемент)

	АС_ПрименитьНормализациюНаименованияУслуги();

КонецПроцедуры

&НаКлиенте
&Перед("ПередЗаписью")
Процедура АС_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)

	АС_ЗаполнитьРеквизитыСозданияУслуги();
	АС_ПрименитьНормализациюНаименованияУслуги();

КонецПроцедуры

&НаКлиенте
Процедура АС_ЗаполнитьРеквизитыСозданияУслуги()

	Если Объект.ТипНоменклатуры <> ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = АС_ОтветственныйТекущегоПользователя();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.ДатаСоздания) Тогда
		Объект.ДатаСоздания = АС_ТекущаяДатаСеанса();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция АС_ОтветственныйТекущегоПользователя()

	СотрудникиПользователя = РегистрыСведений.СотрудникиПользователя.ПолучитьСотрудниковПользователя(
		Пользователи.ТекущийПользователь());
	Если СотрудникиПользователя.Количество() > 0 Тогда
		Возврат СотрудникиПользователя[0];
	КонецЕсли;

	Возврат ПерсональныеНастройкиРУНФ.Прочитать("ОсновнойОтветственный");

КонецФункции

&НаСервере
Функция АС_ТекущаяДатаСеанса()

	Возврат ТекущаяДатаСеанса();

КонецФункции

&НаКлиенте
Процедура АС_ПрименитьНормализациюНаименованияУслуги()

	Если Объект.ТипНоменклатуры <> ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		Возврат;
	КонецЕсли;

	Если Не Объект.АС_НормализоватьНаименованиеУслуги Тогда
		Возврат;
	КонецЕсли;

	НаименованиеУслуги = Строка(Объект.Наименование);
	Если ПустаяСтрока(СокрЛП(НаименованиеУслуги)) Тогда
		Возврат;
	КонецЕсли;

	Объект.Наименование = АС_НормализоватьНаименование(НаименованиеУслуги);
	Объект.НаименованиеПолное = Объект.Наименование;

КонецПроцедуры

&НаКлиенте
Функция АС_НормализоватьНаименование(Значение)

	Результат = СокрЛП(СтрЗаменить(Строка(Значение), Символы.НПП, " "));
	Результат = НРег(Результат);
	Если СтрДлина(Результат) > 0 Тогда
		Результат = ВРег(Лев(Результат, 1)) + Сред(Результат, 2);
	КонецЕсли;
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура АС_ОбновитьВидимостьУслуги()

	Если АС_ПоказыватьВсеПоля Тогда
		АС_ПоказатьВсеПоляВФорме();
		Возврат;
	КонецЕсли;

	ЭтоУслуга = Объект.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга");

	Если ЭтоУслуга Тогда
		Если АС_ВидимостьДоУслуги = Неопределено Тогда
			АС_СохранитьВидимостьДоУслуги();
		КонецЕсли;

		АС_СкрытьПоляДляУслуги();
	Иначе
		АС_ВосстановитьВидимостьДоУслуги();
		Элементы.АС_НормализоватьНаименованиеУслуги.Видимость = Ложь;
		УправлениеФормой();
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура АС_ПоказатьВсеПоля(Команда)

	АС_ПоказыватьВсеПоля = Истина;
	АС_ПоказатьВсеПоляВФорме();

КонецПроцедуры

&НаКлиенте
Процедура АС_ПоказатьВсеПоляВФорме()

	Элементы.ЛеваяКолонка.Видимость = Истина;
	Элементы.ПраваяКолонка.Видимость = Истина;
	Элементы.ОсновныеРеквизиты.Видимость = Истина;

	АС_ПоказатьВсеПоляВКоллекции(Элементы.ЛеваяКолонка.ПодчиненныеЭлементы);
	АС_ПоказатьВсеПоляВКоллекции(Элементы.ПраваяКолонка.ПодчиненныеЭлементы);
	АС_ПоказатьВсеПоляВКоллекции(Элементы.ОсновныеРеквизиты.ПодчиненныеЭлементы);

КонецПроцедуры

&НаКлиенте
Процедура АС_ПоказатьВсеПоляВКоллекции(КоллекцияЭлементов)

	Для каждого ЭлементФормы Из КоллекцияЭлементов Цикл
		ЭлементФормы.Видимость = Истина;
		Попытка
			АС_ПоказатьВсеПоляВКоллекции(ЭлементФормы.ПодчиненныеЭлементы);
		Исключение
			// У листового элемента нет подчиненных элементов.
		КонецПопытки;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура АС_СохранитьВидимостьДоУслуги()

	АС_ВидимостьДоУслуги = Новый Соответствие;
	АС_СохранитьВидимостьКоллекции(Элементы.ЛеваяКолонка.ПодчиненныеЭлементы);
	АС_СохранитьВидимостьКоллекции(Элементы.ПраваяКолонка.ПодчиненныеЭлементы);
	АС_СохранитьВидимостьКоллекции(Элементы.ОсновныеРеквизиты.ПодчиненныеЭлементы);

КонецПроцедуры

&НаКлиенте
Процедура АС_СохранитьВидимостьКоллекции(КоллекцияЭлементов)

	Для каждого ЭлементФормы Из КоллекцияЭлементов Цикл
		АС_ВидимостьДоУслуги.Вставить(ЭлементФормы.Имя, ЭлементФормы.Видимость);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура АС_СкрытьПоляДляУслуги()

	Для каждого ЭлементФормы Из Элементы.ЛеваяКолонка.ПодчиненныеЭлементы Цикл
		ЭлементФормы.Видимость = ЭлементФормы.Имя = "ОсновныеРеквизиты";
	КонецЦикла;

	Для каждого ЭлементФормы Из Элементы.ПраваяКолонка.ПодчиненныеЭлементы Цикл
		ЭлементФормы.Видимость = ЭлементФормы.Имя = "АС_ИнформацияСоздания";
	КонецЦикла;

	Элементы.ОсновныеРеквизиты.Видимость = Истина;
	Для каждого ЭлементФормы Из Элементы.ОсновныеРеквизиты.ПодчиненныеЭлементы Цикл
		ЭлементФормы.Видимость = ЭлементФормы.Имя = "ГруппаТипНоменклатуры"
			ИЛИ ЭлементФормы.Имя = "Наименование"
			ИЛИ ЭлементФормы.Имя = "АС_НормализоватьНаименованиеУслуги";
	КонецЦикла;

	Элементы.Наименование.Видимость = Истина;
	Элементы.АС_НормализоватьНаименованиеУслуги.Видимость = Истина;

КонецПроцедуры

&НаКлиенте
Процедура АС_ВосстановитьВидимостьДоУслуги()

	Если АС_ВидимостьДоУслуги = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Для каждого ИмяИВидимость Из АС_ВидимостьДоУслуги Цикл
		ЭлементФормы = Элементы.Найти(ИмяИВидимость.Ключ);
		Если ЭлементФормы <> Неопределено Тогда
			ЭлементФормы.Видимость = ИмяИВидимость.Значение;
		КонецЕсли;
	КонецЦикла;

	АС_ВидимостьДоУслуги = Неопределено;

КонецПроцедуры
